#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Sun Mar 10 22:53:00 2024

@author: thomas
"""

#設計說明：撰寫一程式，讓使用者輸入一個數字n，則用＠字元列印出n層的直角三角形。
#範例：n = 7

#重要!!!!!!!：range(起始值, 結束值)相當於從起始值～結束值-1
#------------------------------------------------------------------------------




#1
n = int(input("請輸入數字："))

for i in range(1, n+1):  #因為要從1個＠開始，所以直接從1開始。
    print("@"*i)
    
for i in range(n):
    print("@"*(i+1))


#------------------------------------------------------------------------------



#2
#練習：撰寫一程式，讓使用者輸入一個數字x，則用＠字元列印出x層的反直角三角形。
#範例：x = 7

x = int(input("請輸入數字："))

for o in range(x, 0, -1): #
    print("@"*o)


#------------------------------------------------------------------------------


#3
y = int(input("請輸入數字："))

for u in range(1, y+1):
    print((" "*(y-u)) + ("@"*u))


#------------------------------------------------------------------------------



#4
#練習：撰寫一程式，讓使用者輸入一個數字z，則用＠字元列印出z層的靠右邊的反直角三角形。
#範例：z = 7

z = int(input("請輸入數字："))

for t in range(z, 0, -1):
    print((" "*(z-t))+("@"*t))


#------------------------------------------------------------------------------


#5
#練習：撰寫一程式，讓使用者輸入一個數字b，則用＠字元列印出b層的等腰三角形。
#範例：b = 6

b = int(input("請輸入數字："))

for r in range(b):
    print(" "*(b-r-1) + "@"*(r) + "@" + "@"*(r) + " "*(b-r-1))

